#include <stdio.h>

int main()
{














































// 源码
// 反码
// 补码
// CPU只有加法

// 内存里面存储的是二进制的补码

// >> <<只能是整数

    /* int x = 5; */
    // 101--->10;
    /* x >>= 1; */
    /* printf("%d \n", x); */

    // 10--->1000
    /* x <<= 2; */
    /* printf("%d \n", x); */

    /* int a = 10; */
    /* int b = a << 1; */

    //a: 00000000000000000000000000001010;
    //b: 00000000000000000000000000010100;
    // 左移扩大二倍
    /* printf("a = %d\n", a); */
    /* printf("b = %d\n", b); */
    
    /* int a = -1; */
   
    //a: 10000000000000000000000000000001;
    //a: 11111111111111111111111111111110;
    //a: 11111111111111111111111111111111;
    //a: 11111111111111111111111111111111;
    
    //a: 11111111111111111111111111111110;
    //a: 10000000000000000000000000000001;
    //a: 10000000000000000000000000000010;

    /* int b = a << 1; */
    /* printf("a = %d\n", a); */
    /* printf("b = %d\n", b); */



/* 左移（<<）：不会保留符号位，只是把所有位往左移，高位溢出会被丢弃，不会专门保留符号位， */
/* 所以可能会改变符号左移（<<）：不会保留符号位，只是把所有位往左移，高位溢出会被丢弃， */
/* 不会专门保留符号位，所以可能会改变符号 */
    
    //  负数
    /* int a = 1; */
    /* a <<= 31; */
    /* printf("%d \n", a); */
    
    /* int a = -10; */
    /* int b = a >> 1; */
    // 逻辑右移动：最高位直接是零
    // 算术右移动：继承原来的符号


    //a: 10000000000000000000000000001010;
    //a: 11111111111111111111111111110101;
    //a: 11111111111111111111111111110110;
    //
    //a: 11111111111111111111111111111011;
    //a: 10000000000000000000000000000100;
    //a: 10000000000000000000000000000101;
    
    /* printf("a = %d\n", a); */
    /* printf("b = %d\n", b); */







// & | ^ ~;
// 按位与  或 异或 非

// 符号位也要按位与
    int a = 6;
    int b = -7;
    printf("%d \n", a & b);
    printf("%d \n", a | b);
    printf("%d \n", a ^ b);
    printf("%d \n", ~a);
    printf("%d \n", ~b);






















































    return 0;
}

